In [2]:
#Sorting and introduction to the inplace - parameter
# 6월 1일

In [4]:
import pandas as pd

In [6]:
dic = {1 : 10, 3 : 25, 2 : 15, 4:5, 5: 20, 6 : 0, 7 : None}

# 월요일에는 10개 화요일에는 15개 수요일에는 25개가 판매되었다는 딕셔너리 주간 판매량 토요일과 일요일은 판매가 없으므로

In [8]:
dic

{1: 10, 3: 25, 2: 15, 4: 5, 5: 20, 6: 0, 7: None}

In [10]:
sales = pd.Series(dic)

In [12]:
sales

1    10.0
3    25.0
2    15.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [14]:
sales.sort_index()

1    10.0
2    15.0
3    25.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [22]:
sales.sort_index(ascending= True ) # ascending 으로 True, False로 오름차순, 내림차순 설정 가능  
# 복사본을 만들어서 복사본만을 정렬한 것임 inplace: 'bool' = False 이기 때문에

1    10.0
2    15.0
3    25.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [20]:
sales # 인덱스가 그대로임 , 정렬된 인덱스가 메모리에 저장되지 않는 다는 뜻

1    10.0
3    25.0
2    15.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [26]:
 sales.sort_index(ascending=True, inplace=True) # inplace 를 True로 하면 원래값을 대신하게 됨

In [28]:
sales

1    10.0
2    15.0
3    25.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [42]:
sales.sort_values(inplace=True, ascending=False, na_position="first") # 결측값 맨처음 or 맨끝 설정 가능 
sales

7     NaN
3    25.0
5    20.0
2    15.0
1    10.0
4     5.0
6     0.0
dtype: float64

In [44]:
dic = {"Mon" : 25, "Tue" : 10, "Wed" : 30, "Thu" : 40, "Fri" : 50, "Sat" : 0, "Sun" : 0}

In [46]:
dic

{'Mon': 25, 'Tue': 10, 'Wed': 30, 'Thu': 40, 'Fri': 50, 'Sat': 0, 'Sun': 0}

In [48]:
sales = pd.Series(dic)

In [50]:
sales

Mon    25
Tue    10
Wed    30
Thu    40
Fri    50
Sat     0
Sun     0
dtype: int64

In [54]:
sales.sort_index() # 인덱스가 문자열일 때는 아스키코드 기반

Fri    50
Mon    25
Sat     0
Sun     0
Thu    40
Tue    10
Wed    30
dtype: int64

In [56]:
# nlargest() and nsmallest

In [60]:
titanic = pd.read_csv("titanic.csv")

In [62]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [64]:
titanic.head

<bound method NDFrame.head of      survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]>

In [66]:
age = titanic.age

In [68]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [82]:
age.sort_values(ascending=False).head(3)

630    80.0
851    74.0
493    71.0
Name: age, dtype: float64

In [102]:
'''
"""
nlargest(
    n: 'int' = 5,
    keep: "Literal['first', 'last', 'all']" = 'first',
) -> 'Series'
Docstring:
Return the largest `n` elements.
"""
'''

age.nlargest(n = 3) # 가장 큰 원소들을 기본적으로 5개 출력하는 메서드 #

630    80.0
851    74.0
96     71.0
Name: age, dtype: float64

In [106]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [110]:
age.sort_values(ascending=True).iloc[:3] # 왼쪽에는 원본 데이터프레임의 rangeIndex 뜸

803    0.42
755    0.67
644    0.75
Name: age, dtype: float64

In [125]:
age.nsmallest().index # 인덱스 객체 얻을 수 있음

Index([803, 755, 469, 644, 78], dtype='int64')

In [115]:
# idxmin and idxmax

In [127]:
titanic = pd.read_csv("titanic.csv")

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [133]:
age = titanic.age

In [151]:
titanic.age.idxmin()

803

In [139]:
titanic.age.idxmax()

630

In [157]:
titanic.loc[803]

survived         1
pclass           3
sex           male
age           0.42
sibsp            0
parch            1
fare        8.5167
embarked         C
deck           NaN
Name: 803, dtype: object

In [159]:
titanic.loc[630]

survived       1
pclass         1
sex         male
age         80.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 630, dtype: object

In [161]:
titanic.loc[titanic.age.idxmax()] # 같은 결과를 얻을 수 있음

survived       1
pclass         1
sex         male
age         80.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 630, dtype: object

In [163]:
"""
idxmax() / idxmin()의 기본 동작
이름 그대로:

idxmax() → 값이 최대인 곳의 "인덱스(label)" 반환

idxmin() → 값이 최소인 곳의 "인덱스(label)" 반환

즉,
➔ "값을 기준으로 최대/최소를 찾되, 결과는 인덱스 라벨로 준다."
"""

'\nidxmax() / idxmin()의 기본 동작\n이름 그대로:\n\nidxmax() → 값이 최대인 곳의 "인덱스(label)" 반환\n\nidxmin() → 값이 최소인 곳의 "인덱스(label)" 반환\n\n즉,\n➔ "값을 기준으로 최대/최소를 찾되, 결과는 인덱스 라벨로 준다."\n'

In [166]:
# Manipulating Series